spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2002.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
	<application_type>APTPACQA</application_type>                                       <!-- Application type - Acquiring -->
	<application_flow_id>2002</application_flow_id>                                     <!-- Application flow (business process) - Create new acquirer account -->
	<application_status>APST0006</application_status>                                   <!-- Application status - Ready to process -->
	<operator_id>ADMIN</operator_id>                                                	<!-- User name who made this application -->
	<institution_id>1001</institution_id>                                               <!-- Institution identifier -->
	<agent_id>10000001</agent_id>                                                       <!-- Agent identifier -->
	<customer>
		<command>CMMDEXPR</command>                                                     <!-- Command for customer - find existing customer -->
		<customer_number>0000000000000000000697</customer_number>                       <!-- Unique customer number -->
		<contract>
			<command>CMMDEXPR</command>                                                 <!-- Command for contract - find existing contract -->
			<contract_number>00000000000000000000000000000736</contract_number>         <!-- Contract number -->
			<merchant id="merchant_1">
				<command>CMMDEXPR</command>                                             <!-- Find existing parent merchant -->
				<merchant_number>000000070000063</merchant_number>                      <!-- Merchant number -->
			</merchant>
			<service value="70000074">                                                  <!-- Service - attribute value contain service identifier which opened for account -->
				<service_object ref_id="account_1">                                     <!-- Service reference - attribute ref_id contain reference on attached object - account -->
					<start_date>2015-01-14</start_date>                                 <!-- Service open date -->
				</service_object>
			</service>
			<account id="account_1">                                                    <!-- Account - value in attribute ID could be used as reference on this object -->
				<command>CMMDCREX</command>                                             <!-- Command for account - Create new or raise error -->
				<account_number>40817840010009302127</account_number>                   <!-- Number of the new account -->
				<currency>840</currency>                                                <!-- Account currency code - US Dollars -->
				<account_type>ACTP0200</account_type>                                   <!-- Account type - merchant account-->
				<account_object ref_id="merchant_1">                                    <!-- Link account with merchant - ref_id contain reference on merchant object -->
					<account_link_flag>1</account_link_flag>                            <!-- Link/Unlink flag - Link -->
				</account_object>
			</account>
		</contract>
	</customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
